;; -*- no-byte-compile: t; -*-
;;; my/clojure/packages.el

(package! clojure-mode)
(package! cider)
(package! clj-refactor)
(package! flycheck-clj-kondo)
(package! rainbow-delimiters)
(package! paredit)
(package! smartparens)
(package! aggressive-indent)
(package! transient)  ; transient 菜单支持