;; -*- no-byte-compile: t; -*-
;;; my/react/packages.el

(package! rjsx-mode)
(package! typescript-mode)
(package! web-mode)
(package! emmet-mode)
(package! prettier-js)
(package! add-node-modules-path)
(package! npm-mode)
(package! jest)
(package! js2-refactor)
(package! transient)  ; transient 菜单支持