;; -*- no-byte-compile: t; -*-
;;; my/vue/packages.el

(package! vue-mode)
(package! vue-html-mode)
(package! ssass-mode)
(package! typescript-mode)
(package! web-mode)
(package! emmet-mode)
(package! prettier-js)
(package! add-node-modules-path)
(package! npm-mode)
(package! transient)  ; transient 菜单支持