;; -*- no-byte-compile: t; -*-
;;; my/c/packages.el

(package! cc-mode)
(package! cmake-mode)
(package! cmake-ide)
(package! modern-cpp-font-lock)
(package! clang-format)
(package! disaster)
(package! dap-mode)   ; 调试支持
(package! transient)  ; transient 菜单支持